; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-1-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-4 - location
	p1-2 - location
	p2-0 - location
	p2-3 - location
	p3-0 - location
	p3-2 - location
	p3-4 - location
	p4-0 - location
	)
	(:init
	(at driver1 s3)
	(at truck1 s3)
	(empty truck1)
	(at package1 s4)
	(at package2 s0)
	(at package3 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(link s0 s4)
	(link s4 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s2)
	(link s2 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s4)
	(at truck1 s0)
	(at package1 s1)
	(at package2 s4)
	(at package3 s1)
	))


)

; plan
1. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 0 of 5
2. (drive-truck truck1 s3 s4 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 0 of 5
3. (load-truck package1 truck1 s4)
   deleted: (at package1 s4)
   added: (in package1 truck1)
   goals met: 0 of 5
4. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 1 of 5
5. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   goals met: 1 of 5
6. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 1 of 5
7. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 0 of 5
8. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 1 of 5
9. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 2 of 5
10. (drive-truck truck1 s1 s4 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 2 of 5
11. (unload-truck package2 truck1 s4)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 3 of 5
12. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 4 of 5
13. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 4 of 5
14. (walk driver1 s0 p0-4)
   deleted: (at driver1 s0)
   added: (at driver1 p0-4)
   goals met: 4 of 5
15. (walk driver1 p0-4 s4)
   deleted: (at driver1 p0-4)
   added: (at driver1 s4)
   goals met: 5 of 5
